In [1]:
import pandas as pd

In [2]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [5]:
x = store_items.isnull() #.sum().sum()
x

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [6]:
x = store_items.isnull().sum()#.sum()
x

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [7]:
x = store_items.isnull().sum().sum() # gives the number of NaN values
x

3

In [8]:
store_items.count() # gives the number of non-NaN values

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [9]:
store_items.dropna(axis=0) # removes or eliminates any rows that contains a NaN value
# note the above operations still does not modify the original array

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [10]:
store_items.dropna(axis=1) # removes or eliminates any columns that contains a NaN value
# note the above operations still does not modify the original array

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [11]:
# we can modify the original array by using the inplace argument as below
# store_items.dropna(axis=1, inplace=True) # this ensures the original array is modified when the operation is executed

In [12]:
store_items.fillna(0) # replaces all NaN values with a 0

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [13]:
# we can also fill the NaN from the previous row or column with something called as forward filling
store_items.fillna(method='ffill', axis=0) # still one NaN in first will be found
# this is since the condition is satified to fill previous value in that column only for NaN values in store 3
# i.e., store 3 gets values from store 2 while store 1 has no previous column

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [14]:
store_items.fillna(method='ffill', axis=1) # here, the condition satifies and fills NaN values from the previous value in that row for all

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [15]:
# there is also a backward filling and this replaces each NaN with the next value in that column
store_items.fillna(method='backfill', axis=0) # next value along the columns

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [16]:
store_items.fillna(method='backfill', axis=1) # next value along the rows

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [17]:
store_items.interpolate(method='linear', axis=0) # replace with linear interpolation values along the column

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [18]:
store_items.interpolate(method='linear', axis=1) # replace with linear interpolation values along the rows

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0